<html>
<meta charset="utf-8" />
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width,initial-scale=1.0,maximum-scale=1.0" />

<head>
	<link rel="shortcut icon" href="/favicon.ico" type="image/x-icon">
	<link rel="icon" href="/favicon.ico" type="image/x-icon">
	<!-- CSS -->
	<link href="../../third_party/foundation/stylesheets/foundation.min.css" rel="stylesheet" type="text/css" />
	<link href="../../third_party/jquery_snippet/jquery.snippet.min.css" rel="stylesheet" type="text/css" />
	<link href="../../css/site.css" rel="stylesheet" type="text/css" />
	
			<link href="../../javascript/lib/slds/SLDS.css" rel="stylesheet" type="text/css" />
	
	
	<!-- Page Specific CSS -->

		<style type="text/css">
			
			
			
			/* Change the quote color for flavor */
			#story .quote {
				color: None;
			}
			
			
			
		</style>
	
	<!-- Title -->
	<title>Graph Database Modelling by Adam Tavares</title>
	
	<!-- Google Analytics -->
	<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-42372677-1', 'adamtavares.com');
  ga('send', 'pageview');

</script>
</head>

<body>
	<!-- Navigation -->
	<section id="extra-info">
		<div id="panel">
			<a id="home" class="link" href="../..">[ Home ]</a>
		</div>
	</section>
	
	<div id="story" class="container main">
		<section id="header">
		
			<!-- Keywords -->
			<div class="row">
				<div class="twelve columns">
					<div id="genre">
					
						<a href="../../#guide">guide</a>
					
						<a href="../../#sparql">sparql</a>
					
					</div>
				</div>
			</div>
			
			<!-- Title and Author -->
			<div class="row">
				<div id="meta" class="twelve columns">
					<h1 id="title">Graph Database Modelling</h1>
					<h2 id="subtitle">'Getting In On That Open-Linked Data Action'</h2>
					<img id="avatar" src="../../img/avatar_default.jpg" alt="Adam Tavares" />
					<h3 id="author">by <span class="name">Adam Tavares</span></h3>
					<h4 id="date">Published March 26, 2014</h4>
				</div>
			</div>
		</section>
		
		<!-- Story -->
		<section id="text">
			<div class="row">
				<div class="twelve columns">
					<p>You're a researcher.
You have gathered lots of data. 
You want to store that data in a convenient place so it can be easily searched, analyzed, and repurposed by yourself, collaborators, and anonymous people the world over.
In other words you want to turn "data" into "open-linked data."
Great!  But there are some things you'll have to learn about the underlying technologies that have made open-linked data possible in the first place, graph-databases in particular.
I believe the quicker you start playing with your own graph-database the quicker you'll get a useful database out into the world.
So let's just jump in.</p>
<h1>Start Playing</h1>
<p>There are many different graph-database packages out there in the wild.
The one we'll be playing with is the Apache Foundation's, Jena.
Jena is a type of graph-database called a triple-store.
Jena is the database itself, an implementation of the W3C's RDF ( Resource Description Framework) standard.
You interact with Jena through a server called Fuseki.
The two come packaged together.
The names sometimes are used interchangably.</p>
<h1>Install Jena-Fuseki</h1>
<p>I'm assuming you're using some flavor of Unix ( Linux or Mac OSX usually ) as your OS.</p>
<ul>
<li><a href="http://jena.apache.org/download/index.cgi"> Go to the downloads page </a></li>
<li>Click the binary distribution link "jena-fuseki-[version]-distribution.zip"</li>
<li>
<p>If you know Unix the commands below should make sense.  If it looks like gibberish find a friend to help.</p>
<pre><code>mkdir -p /usr/local/fuseki
cp jena-fuseki-1.0.1-distribution.zip /usr/local
cd /usr/local
unzip jena-fuseki-1.0.1-distribution.zip
ln -s jena-fuseki-1.0.1 fuseki
cd fuseki
chmod +x fuseki-server s-**
fuseki-server --update --mem /ds &amp;
</code></pre>
</li>
</ul>
<p>You now have a fuseki-server running on port 3030.</p>
<p>Fuseki uses the HTTP protocol to communicate with the outside world just like a webserver,
which means you can connect to it through your webbrowser.</p>
<p><a href="http://localhost:3030/"> http://localhost:3030/ </a></p>
<h1>Your Playground</h1>
<ul>
<li>Click 'Control Panel' link</li>
<li>Click 'Select' button</li>
</ul>
<p>So this page is where you can query the database and add new data.
This is your playground.</p>
<h1>Adding Data</h1>
<p>Right now your database is empty.
Let's add some data using SPARQL-Update syntax.
Copy the text below into the SPARQL Update field and click 'Perform update'</p>
<pre><code>PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
INSERT DATA {
    &lt;http://example/book1&gt; dc:title    "A new book" ;
                           dc:creator  "A.N.Other" .
}
</code></pre>
<p>So what's going on here?
Well we've added a unique identifier of a book <strong>&lt;http://example/book1&gt;</strong>.
This unique identifier is a URI, a Universal Resource Identifier.</p>
<p>We attached two bits of data to the book URI, title and creator.
The concept of "a title" and "a creator" have already been defined in another popular open-linked database 
so we can reuse them, <strong>&lt;http://purl.org/dc/elements/1.1/title&gt;</strong> <strong>&lt;http://purl.org/dc/elements/1.1/creator&gt;</strong>
Typing <strong>&lt;http://purl.org/dc/elements/1.1/title&gt;</strong> is cumbersome so we shortened it to dc:title.
We can only use these kinds of abbreviations if we explicitly declare what they are.
We do that at the very beginning with <strong>PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;</strong></p>
<p>The specific title and creator attached to this book are just text not URIs, "A new book" and "A.N.Other".
Because they are just text they can't be attached to anything else.
Sometimes that's okay.
Sometimes it isn't.
With experience you'll learn when using text or URIs is appropriate.</p>
<p>There are other nuances to SPARQL-Update syntax displayed here... like, 
"What is up with the semi-colon and period?",
I'll explain them later. 
<a href="http://www.w3.org/Submission/SPARQL-Update/"> Here's the document defining SPARQL Update syntax </a></p>
<p>Let's add another book before we move on.</p>
<pre><code>PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
INSERT DATA {
    &lt;http://example/book2&gt; dc:title    "An old book" ;
                           dc:creator  "S.K.Eleton" .
}
</code></pre>
<h1>Querying Data</h1>
<p>So now you have some data in your database.
Now let's get it out of there.
We do that with the SPARQL Query Language.
Copy the text below into the SPARQL Query field and click 'Get Results'</p>
<pre><code>SELECT ?s ?p ?o 
WHERE {
    ?s ?p ?o
}
</code></pre>
<p>This query will return all data in your database.
Luckily our total dataset is very small, so it runs quickly.
You should get output that looks like this...</p>
<pre><code>--------------------------------------------------------------------------------------
| s                      | p                                         | o             |
======================================================================================
| &lt;http://example/book2&gt; | &lt;http://purl.org/dc/elements/1.1/creator&gt; | "S.K.Eleton"  |
| &lt;http://example/book2&gt; | &lt;http://purl.org/dc/elements/1.1/title&gt;   | "An old book" |
| &lt;http://example/book1&gt; | &lt;http://purl.org/dc/elements/1.1/creator&gt; | "A.N.Other"   |
| &lt;http://example/book1&gt; | &lt;http://purl.org/dc/elements/1.1/title&gt;   | "A new book"  |
--------------------------------------------------------------------------------------
</code></pre>
<p>Queries can use PREFIX just like update statements so you could issue a query like this one:</p>
<pre><code>PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
SELECT ?s ?p ?o 
WHERE {
    ?s ?p ?o
}
</code></pre>
<p>The output changes as you'd expect.</p>
<pre><code>-------------------------------------------------------
| s                      | p          | o             |
=======================================================
| &lt;http://example/book2&gt; | dc:creator | "S.K.Eleton"  |
| &lt;http://example/book2&gt; | dc:title   | "An old book" |
| &lt;http://example/book1&gt; | dc:creator | "A.N.Other"   |
| &lt;http://example/book1&gt; | dc:title   | "A new book"  |
-------------------------------------------------------
</code></pre>
<p>So how does the query work?
Data relationships in Jena are defined by triples.
Triples are basically declarative sentences with one subject, one predicate, and one object.</p>
<p>You specify what bits of data you want to extract with this line.</p>
<pre><code>SELECT ?s ?p ?o
</code></pre>
<p>If you only wanted the predicate and the object of a triple, because say you know exactly which book you want.
You could run a query without <strong>?s</strong> like this one.</p>
<pre><code>PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
SELECT ?p ?o 
WHERE {
    &lt;http://example/book1&gt; ?p ?o
}
</code></pre>
<p>Here's the output of that query</p>
<pre><code>-----------------------------
| p          | o            |
=============================
| dc:creator | "A.N.Other"  |
| dc:title   | "A new book" |
-----------------------------
</code></pre>
<p>Now what if you only wanted the title of all books?
You could run this query...</p>
<pre><code>PREFIX dc: &lt;http://purl.org/dc/elements/1.1/&gt;
SELECT ?s ?o 
WHERE {
    ?s dc:title ?o
}
</code></pre>
<p>...and get these results.</p>
<pre><code>------------------------------------------
| s                      | o             |
==========================================
| &lt;http://example/book2&gt; | "An old book" |
| &lt;http://example/book1&gt; | "A new book"  |
------------------------------------------
</code></pre>
<p><a href="http://www.w3.org/TR/sparql11-query/"> Here's the document defining SPARQL query syntax </a></p>
<h1>If You Want To Delete ALL Of Your Test Data</h1>
<p>Copy the text below into the SPARQL Update field and click 'Perform update'.</p>
<pre><code>DELETE WHERE { ?s ?p ?o }
</code></pre>
<h1>'Conceptual Map' aka 'Categorical Structure' aka 'Ontology'</h1>
<p>Now begins the fun part.
Modelling YOUR data.</p>
<p>Maybe you have a lot of data already,
maybe you have a small sample of representative data, 
maybe you just have an idea of the kinds of data you'll be gathering.</p>
<p>In any case a database's categorical structure, its ontology, needs to be defined.</p>
<p>Developing an ontology is as much art as it is science.
So I'm going to develop an ontology and document the most important parts of my process to guide you along.</p>
<p>I'm interested in building a system for inventorying images and their metadata 
so that's the kind of database ontology I'll be developing.</p>
<h1>List</h1>
<p>What sorts of data am I going to store?
I'll list them to start.</p>
<ul>
<li>URL to the image</li>
<li>photograph or graphic?</li>
<li>name</li>
<li>caption</li>
<li>width</li>
<li>height</li>
<li>dpi</li>
<li>mime-type ( file type: jpeg, png, gif, etc... )</li>
<li>date created</li>
<li>time of day</li>
<li>latitude</li>
<li>longitude</li>
<li>size</li>
<li>model of camera used</li>
<li>shutter speed</li>
<li>aperture size</li>
<li>digital or film?</li>
<li>collections of images it belongs to</li>
<li>person who made image</li>
<li>what's depicted in the image?</li>
</ul>
<h1>Research Preexisting Ontologies</h1>
<p>Also it's worth researching whether there are existing ontologies devised to describe portions of your data already.
The less you recreate the wheel and the more you use existing ontologies the more 'linked' your data will become.</p>
<pre><code>Hint: PREFIX statement URLs will often lead to a definition of the ontology.
Put PREFIX URLs into your webbrowser and see where they lead.
</code></pre>
<h1>Grouping and Typing</h1>
<p>My next step is to group like elements together and note the type of data of each element.
I will add items along the way if I realize I forgot something.</p>
<p>Right now I'm still exploring the relationships between the data and
I'm thinking about the values that I'll be storing.</p>
<h1>Notation</h1>
<p>So once you know what bits of data you'll be storing you have to map the relationships between those bits.
The best notation system I know of for exploring relationships in an ontology is the ball and stick system.</p>
<div class="picture">
    <img src="img/ball_stick.png" />
    <p class="caption">A classic conceptual modelling tool</p>
</div>

<div class="picture">
    <img src="img/ball_stick_labels.png" />
    <p class="caption">Label your nodes and connections</p>
</div>

<h1>A Quick Grouping And Typing In Outline Format</h1>
<p>Once you have a clear idea of the relationships between your data you'll want to think about data types.
So now I'll represent the relationships between my nodes in a more abstract outline form with data-types.</p>
<ul>
<li>
<p>&lt;image&gt;</p>
<ul>
<li>id<ul>
<li>URL ( text )</li>
<li>name ( text )</li>
</ul>
</li>
<li>user<ul>
<li>&lt;user&gt;</li>
</ul>
</li>
<li>storage<ul>
<li>&lt;file-type&gt;</li>
<li>size [ megabytes ] - ( float )</li>
</ul>
</li>
<li>interpretation<ul>
<li>&lt;image-type&gt;</li>
<li>&lt;caption&gt;</li>
</ul>
</li>
<li>resolution<ul>
<li>width [ pixels ] - ( int )</li>
<li>height in [ pixels ] - ( int )</li>
<li>dpi ( int )</li>
</ul>
</li>
<li>time<ul>
<li>created ( time )</li>
</ul>
</li>
<li>location<ul>
<li>latitude ( float )</li>
<li>longitude ( float )</li>
</ul>
</li>
<li>technology<ul>
<li>&lt;camera-model&gt;</li>
<li>shutter ( float )</li>
<li>aperture ( float )</li>
<li>exposure ( float )</li>
</ul>
</li>
<li>permssions<ul>
<li>&lt;copyright&gt;</li>
</ul>
</li>
<li>grouping<ul>
<li>&lt;collection&gt;</li>
</ul>
</li>
</ul>
</li>
<li>
<p>&lt;user&gt;</p>
<ul>
<li>id ( int )</li>
<li>name ( text )</li>
</ul>
</li>
<li>
<p>&lt;copyright&gt;</p>
<ul>
<li>shortname ( text )</li>
<li>fullname ( text )</li>
<li>legalese ( text )</li>
</ul>
</li>
<li>
<p>&lt;caption&gt;</p>
<ul>
<li>created ( time )</li>
<li>text ( text )</li>
<li>&lt;user&gt;</li>
</ul>
</li>
<li>
<p>&lt;camera-model&gt;</p>
<ul>
<li>name ( text )</li>
<li>digital ( bool )</li>
</ul>
</li>
<li>
<p>&lt;image-type&gt;</p>
<ul>
<li>name ( text )</li>
</ul>
</li>
<li>
<p>&lt;collection&gt;</p>
<ul>
<li>name ( text )</li>
<li>created ( date )</li>
<li>summary ( text )</li>
</ul>
</li>
<li>
<p>&lt;sub-img&gt;</p>
<ul>
<li>coords ( sequence of floats )</li>
<li>&lt;img&gt;</li>
<li>&lt;caption&gt;</li>
</ul>
</li>
</ul>
<h1>RDF datatypes -- "typed literals"</h1>
<p>Here's some links for more details on RDF datatyping.</p>
<ul>
<li><a href="https://jena.apache.org/documentation/notes/typed-literals.html">https://jena.apache.org/documentation/notes/typed-literals.html</a></li>
<li><a href="http://www.w3.org/TR/swbp-xsch-datatypes/">http://www.w3.org/TR/swbp-xsch-datatypes/</a></li>
</ul>
<h2>Available datatypes</h2>
<p>The most commonly used:</p>
<ul>
<li>string</li>
<li>int</li>
<li>unsignedInt</li>
<li>float </li>
<li>Boolean</li>
<li>dateTime</li>
</ul>
<p>And the rest:</p>
<p>long short byte double unsignedByte unsignedShort unsignedLong decimal integer nonPositiveInteger nonNegativeInteger positiveInteger negativeInteger normalizedString anyURI token Name QName language NMTOKEN ENTITIES NMTOKENS ENTITY ID NCName IDREF IDREFS NOTATION hexBinary base64Binary date time duration gDay gMonth gYear gYearMonth gMonthDay</p>
<h1>Convert Your "Paper Ontology" To "RDF"</h1>
<p>So there's a couple of ways to do this.
As you're exploring it's probably best to write INSERT DATA statements.
Below are some examples.</p>
<h2>Insert Image Record</h2>
<pre><code>PREFIX ex: &lt;http://example/&gt;
INSERT DATA {
    ex:img1 ex:url "http://127.0.0.1/imgs/Aerial01.jpg";
            ex:name "Aerial Photograph".
}
</code></pre>
<h2>Add A Collection</h2>
<pre><code>PREFIX ex: &lt;http://example/&gt;
INSERT DATA {
    ex:collection1 ex:name "Aerial Photographs";
                   ex:summary "A collection of Aerial Photographs".
}
</code></pre>
<h2>Add Images To A Collection</h2>
<pre><code>PREFIX ex: &lt;http://example/&gt;
INSERT DATA {
    ex:collection1 ex:possesses ex:img1.
}
</code></pre>
<p>Eventually you'll want to create a .ttl document to store all of your triples.</p>
<h1>.ttl ( Turtle ) Documents</h1>
<ul>
<li><a href="http://www.w3.org/TeamSubmission/turtle/">http://www.w3.org/TeamSubmission/turtle/</a></li>
</ul>
<p>Turtle format allows you to write RDF triples as a compact plain-text file.
It's probably the easiest way to migrate your data to your Fuseki instance.
Here's an example.  It should look somewhat familiar.</p>
<pre><code>@base &lt;http://example.org/&gt; .
@prefix rdf: &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#&gt; .
@prefix rdfs: &lt;http://www.w3.org/2000/01/rdf-schema#&gt; .
@prefix foaf: &lt;http://xmlns.com/foaf/0.1/&gt; .
@prefix rel: &lt;http://www.perceive.net/schemas/relationship/&gt; .

&lt;#green-goblin&gt;
    rel:enemyOf &lt;#spiderman&gt; ;
    a foaf:Person ;    # in the context of the Marvel universe
    foaf:name "Green Goblin" .

&lt;#spiderman&gt;
    rel:enemyOf &lt;#green-goblin&gt; ;
    a foaf:Person ;
    foaf:name "Spiderman" .
</code></pre>
<p>Lots more examples here.</p>
<ul>
<li><a href="http://www.w3.org/TR/2014/REC-turtle-20140225/">http://www.w3.org/TR/2014/REC-turtle-20140225/</a></li>
</ul>
<h1>Loading a .ttl Document Into Your Database</h1>
<pre><code>cd /usr/local/fuseki
s-put http://localhost:3030/ds/data default /path/to/your/ttl/file.ttl
</code></pre>
<h1>Putting Your Database To The Test</h1>
<p>So your data needs to be put to the test early on in the process.
Define what subsets of data you need and what formats you'll need it in.
Start writing the queries sooner rather than later.
Do not wait until the ontology is "finalized".
The ontology and the necessary queries should be developed in tandem, 
because if your queries become extremely complicated or query performance is poor 
this may be a sign that your ontology needs revision.</p>
<h2>Revise, Revise, Revise</h2>
<p>Keep revising your ontology and queries and keep track of these revisions.
Source control is your friend in this case.
I highly recommend learning how to use Git or some other source control system.</p>
<h2>Document As You Go</h2>
<p>To have a truly useful database it needs to be documented.
And you need documentation in two flavors.</p>
<ul>
<li>Developer documentation.</li>
<li>User documentation.</li>
</ul>
<p>Important aspects to document are...</p>
<ul>
<li>The ontology itself ( OWL format )</li>
<li>Systems for acquiring new data and vetting it</li>
<li>The technical infrastructure of your hosting environment</li>
</ul>
<p>It's all about eliminating barriers of entry to people who want to use your data and the people who will maintain and extend your systems.</p>
<h1>The final stretch</h1>
<p>Once the ontology is defined a "production system" of the database needs to be created.
The production system should be load tested.
A security audit should be performed.
Then promote your database.</p>
<p>Get people using it.
Get feedback.
Revise, revise, and revise...</p>
<h1>Reference materials</h1>
<ul>
<li>Language Codes<ul>
<li><a href="http://www.loc.gov/standards/iso639-2/php/code_list.php">http://www.loc.gov/standards/iso639-2/php/code_list.php</a><ul>
<li>SPARQL uses the W3C standard 'ISO 639-1 Code'</li>
</ul>
</li>
</ul>
</li>
<li>Popular Existing Ontologies<ul>
<li><a href="http://www.w3.org/TR/owl-time/">http://www.w3.org/TR/owl-time/</a> : Time</li>
</ul>
</li>
</ul>
				</div>
			</div>
		</section>
		
		<!-- Copyright -->
		<section id="footer">
			<div class="row">
				<div class="twelve columns">
					<div id="copyright">&copy; Adam Tavares 2014</div>
				</div>
			</div>
		</section>
	</div>
</body>

<!-- Javascript -->
<!-- 3rd Party -->
<script src="//ajax.googleapis.com/ajax/libs/jquery/1.9.0/jquery.min.js"></script>
<script type="text/javascript" src="../../third_party/foundation/javascripts/modernizr.foundation.js"></script>
<script type="text/javascript" src="../../third_party/foundation/javascripts/foundation.min.js"></script>
<script type="text/javascript" src="../../third_party/foundation/javascripts/jquery.event.move.js"></script>
<script type="text/javascript" src="../../third_party/foundation/javascripts/jquery.event.swipe.js"></script>
<script type="text/javascript" src="../../third_party/foundation/javascripts/jquery.foundation.forms.js"></script>
<script type="text/javascript" src="../../third_party/foundation/javascripts/jquery.foundation.mediaQueryToggle.js"></script>
<script type="text/javascript" src="../../third_party/foundation/javascripts/app.js"></script>
<script type="text/javascript" src="../../third_party/jquery_snippet/jquery.snippet.js"></script>
<script type="text/javascript" src="../../third_party/jquery_snippet/sh_sh.js"></script>

<!-- Custom -->
<script type="text/javascript" src="../../javascript/lib/lib.min.js"></script>
<script type='text/javascript' src='../../javascript/site.js'></script>

<!-- Page Specific -->



<script type="text/javascript" src="../../javascript/lib/slds/SLDS.js"></script>

<script type="text/javascript" src="gdb_modelling.js"></script>


</html>